<?php

/**
 * 用于配置错误信息提示
 */

return [
    "0" => '调用成功',
    "1" => '调用失败',
    "2" => 'token认证失败',
    "3" => '请求太频繁，请稍后再试',
    "4" => '网络繁忙,请稍后再试',
    "5" => '事务提交失败',
    "6" => '数据不能为空',
    "10" => '服务数据层错误',
    "11" => '上传错误',
    "12" => '没有该内容',
    "13" => '用户key已过期',
    "14" => '错误操作',
    "15" => '请勿重复操作',
    "18" => '状态未改变',
    "19" => '签名串认证失败',
    "20" => '不存在该版本号',
    "21" => '参数错误',
    "22" => 'access_token不能为空',
    '23' => '短信调用失败',
    '24' => 'access_token已过期',
    '25' => 'java接口请求失败',

    // 1000-1299 会员信息
    '1001' => '验证码间隔时间未到',
    '1002' => '该手机号已被绑定',
    '1003' => '验证码不存在',
    '1004' => '验证码不匹配',
    '1005' => '用户没有绑定手机号',
    '1006' => '您已参加过此活动',
    '1007' => '用户未授权',

    // 2001-2199 订单信息
    '2001' => '出行人数据错误',
    '2002' => '订单构建异常',
    '2003' => '没有该订单',
    '2004' => '该订单已支付',
    '2005' => '微信支付失败',
    '2006' => '订单数据异常',

    //分享活动
    '3001' => '你已参与过活动',
    '3002' => '当前阶段抽奖已结束',
    '3003' => '核销码错误',
    '3004' => '核销码已使用',

    //核销
    '4001' => '登录账号错误',
    '4002' => '登录密码错误',
    '4003' => '该账号已禁用',
    '4004' => '登录次数过多，请明日再试',
];
