<?php
/**
 * Created by PhpStorm.
 * User: yanglidong
 * Date: 2020/2/29
 * Time: 10:08
 */

return [
    'profile_data' => [
        'business_type' => [
            'type'=> '职业',
            'options' => [
                '机关、企事业单位人员',
                '专业技术人员',
                '商业、服务业人员',
                '农、林、牧、渔、水利业生产人员',
                '生产、运输设备操作人员及有关人员',
                '军人',
                '学生',
                '退休者',
                '私营业主',
                '自由职业者',
                '全职太太',
                '其他'
            ],
        ],
        'degree' => [
            'type'=> '学历',
            'options' => [
                '高中',
                '大专',
                '本科',
                '硕士或以上',
                '其他'
            ],
        ],
        'month_income' => [
            'type'=> '收入',
            'options' => [
                '0-5000',
                '5001-10000',
                '10001-20000',
                '20001-50000',
                '50001-100000',
                '1000001以上'
            ],
        ],
    ]
];