<?php
// +----------------------------------------------------------------------
// | 微信模板消息
// +----------------------------------------------------------------------
return [
    // 生日
    'birthday' => [
        'template_id' => 'cezwSvi2LiOjpczz8D_NpNw-kzVOq-9DF4taS8C6gOE' ,
        'data'        => [
            'first'    => '{{祝福提示语}}' ,
            'keyword1' => '{{会员卡号}}' ,
            'keyword2' => '{{优惠券名称}}' ,
            'keyword3' => '{{礼品卡类型}}' ,
            'keyword4' => '{{发放时间}}' ,
            'remark'   => '{{备注}}' ,
        ]
    ] ,
    // 积分清零
    'reset'    => [
        'template_id' => 'OPENTM414861685' ,
        'data'        => [
            'first'    => '{{提示语}}' ,
            'keyword1' => '{{扣除时间}}' ,
            'keyword2' => '{{扣除积分}}' ,
            'keyword3' => '{{扣除原因}}' ,
            'keyword4' => '{{当前积分}}' ,
            'remark'   => '会员积分有效期：每个自然年度的次年一月底（1月31日）清除前一年度全部累计积分。点击进入' ,
        ]
    ]
];
