<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 日志记录方式，内置 file socket 支持扩展
    'type'        => 'File',
    // 日志保存目录
    'path'        => '',
    // 日志记录级别
    'level'       => [],
    // 单文件日志写入
    'single'      => false,
    // 独立日志级别: V5.1.17+版本开始
    // 如果apart_level设置为true，则表示所有的日志类型都会独立记录
    'apart_level' => true,
    // 最大日志文件数量
    'max_files'   => 0,
    // 日志授权key,满足其条件才记录日志 Log::key(Request::ip());
    'allow_key' => [],
    // 开启json日志的记录
    'json' => false,
    // 是否关闭日志写入
    'close'       => false,
];
